{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 0
    }
  },
  "questIDLow:4": 1501,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "partySingleReward:1": 0,
      "visibility:8": "UNLOCKED",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "adventurebackpack:blockCampFire",
        "Count:3": 1,
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 1,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
      "name:8": "Help Build a Railroad System!",
      "isGlobal:1": 0,
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
      "desc:8": "Did you know Stone Legion formally known as Godcraft had the biggest Vanilla Rail System in Minecraft for the longest time?\n\nWe love Railroads and yes there are many \"Cheaty\" methods of transportation in GTNH. That being said it does not mean we block them or force you to use specific forms of transportation. We can have fun creating community based projects like a GTNH Railcraft System.\n\nWe hope people will consider making nice Paths, Bridges, community farms and even in the future Railroads to other players and help connect our community / server. \n\nTry to build bridges with at least 2 air blocks above water.\n\nHow awesome would it be if we could show the GTNH Community the fun and cool ways of Railcraft and a massive system around the Server. \n\nThis is part of why were are consider a more slower community. We don't Rush not Max Tier's, etc. Instead we take our time and we attempt to make a more community focused and interactive server. \n\nAs time goes on and our community grows, we can do community videos and tours around the server.\n\nSo Consider being part of the community and work on fun projects to welcome new players and keep old players engaged! \n\n\n§c[url]https://discord.gg/kBTabCX[/url]"
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:item",
      "index:3": 0,
      "rewards:9": {
        "0:10": {
          "id:8": "dreamcraft:item.CoinTechnician",
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      }
    }
  }
}